<<<<<<< HEAD
=======
# 세그먼트 트리
# 7578번 공장
>>>>>>> 54b218d687d83e774dbbd1e4b864f4c74a842eb7
# 비트 마스킹
# 1562번 계단수
# 2098번 외판원 순회(O)
# n이10 넘어가서 일반적인 재귀 x(n이 16이라서 시간복잡도 : 15! 정도)
# 어떤 정점 출발 ok(사이클)
# 그래서 재귀 + dp인 메모이제이션
# (같은정점을 썼을때 메모이제이션 가능) : 1 2 3 5, 1 3 2 5

# CCW
# 11758번 CCW
# 17387번 선분 교차 2
# 2162번 선분 그룹
# 2166번 다각형의 면적
# 2536번 버스 갈아타기

# 스위핑
# 10165번 버스 노선
# 17619번 개구리 점프
# 2672번 여러 직사각형의 전체 면적 구하기
# 2492번 보석
# 2496번 금강석

# 벨만포드
# 11657번 타임머신(O)
# 3860번 할로윈 묘지
# 1738번 골목길(O)
# 1865번 웜홀
# 1219번 오민식의 고민


# 플로이드–워셜
# 11404번 플로이드(O)
# 1389번 케빈 베이컨의 6단계 법칙
# 1613번 역사(O)
# 1956번 운동(O)
# 1507번 궁금한 미호
# 1486번 등산
# 1602번 도망자 원숭이




